Autodesk.Revit.DB.TextNoteOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TextNoteOptions.KeepRotatedTextReadable
Flag controling whether a rotate text is to stay oriented to be always readable.
Remarks:
Default value is True.
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.VerticalAlignment
Vertical alignment of the text.
Remarks:
Default is Top alignment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.HorizontalAlignment
Horizontal alignment of the text.
Remarks:
Default is Left alignment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.Rotation
Base line angle of a text note, in radians.
Remarks:
Default value is 0.0.
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.TypeId
Id of a text type that defines the style of a text note.
Remarks:
No default value. A valid type element Id must be set prior using the options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextNoteOptions.#ctor(Autodesk.Revit.DB.ElementId)
Constructs text options to create text of the given type.
Remarks:
Except for the TypeId, all other properties of the option class will be populated with their respective default values.
typeId:
Id of a text type that defines the style of a text note.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.TextNoteOptions.#ctor
Default constructor; populates the options with their respective default values.
Remarks:
The constructed options need to be given a typeId before it can be used to create a text note.
Since:
2016

Autodesk.Revit.DB.TextNoteOptions
Options to use when creating a new text note element.
Remarks:
Use an instance of this class as an argument in the TextNote.Create methods.
Since:
2016